---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayDepthCueing.EndPercentage
source: html/8b120fe1-09ab-d546-9eeb-71a3ddc6bc81.htm
---
# Autodesk.Revit.DB.ViewDisplayDepthCueing.EndPercentage Property

The end percentage defines where depth cueing ends.
 Values between 0 and 100.

## Syntax (C#)
```csharp
public int EndPercentage { get; }
```